fgalliat/BasicAr/subComponents/ESP32_Pocketv3/mcu2/ESP32TwinMCU2.h
  DFRobotDFPlayerMini myDFPlayer;

  void GenericMCU_MUSIC_PLAYER::setup() {
    // needs up to 3secs
    if (!myDFPlayer.begin(mp3Serial)) {
      mcu->println("Unable to begin:\n1.Please recheck the connection!\n2.Please insert the SD card!");
      this->ready = false;
      // delay(500);
      return;
    }
    mcu->println("DFPlayer Mini online.");
    delay(100);
    myDFPlayer.volume(20);  //Set volume value. From 0 to 30

    this->ready = true;
  }

  // from 1 to 2999
  void GenericMCU_MUSIC_PLAYER::playTrack(int trckNum) { 
    if ( !this->ready ) { mcu->println("Music Player not ready !"); return; }

    // positionate only the current file ???
    myDFPlayer.playMp3Folder(trckNum); // plays SD:/MP3/0001.mp3 - @ least 1st song of /MP3/
    delay(100);
    myDFPlayer.play(trckNum); // ??????
  }

  static bool __mp3Paused = false;

  void GenericMCU_MUSIC_PLAYER::pause() { 
    if ( !this->ready ) { mcu->println("Music Player not ready !"); return; }
    if ( !__mp3Paused ) {
      myDFPlayer.pause();
      __mp3Paused = true;
    } else {
      myDFPlayer.start();
      __mp3Paused = false;
    }
  }

  void GenericMCU_MUSIC_PLAYER::next() { 
    if ( !this->ready ) { mcu->println("Music Player not ready !"); return; }
    myDFPlayer.next();
  }

  void GenericMCU_MUSIC_PLAYER::prev() { 
    if ( !this->ready ) { mcu->println("Music Player not ready !"); return; }
    myDFPlayer.previous();
  }

  /* from 0-30 */
  void GenericMCU_MUSIC_PLAYER::setVolume(uint8_t volume) { 
    if ( !this->ready ) { mcu->println("Music Player not ready !"); return; }
    myDFPlayer.volume(volume);
  }

  bool GenericMCU_MUSIC_PLAYER::isPlaying() {
    if ( !this->ready ) { return false; }
    
    // WIRED to #1 MCU !!!
    return false;
  }

  void GenericMCU_MUSIC_PLAYER::stop() {
    if ( !this->ready ) { mcu->println("Music Player not ready !"); return; }
    myDFPlayer.stop();
  }

  // ======== Screen ====================================================================
  
  // TFT_eSPI Lib is pretty faster than Adafruit one
  #include <TFT_eSPI.h> // Hardware-specific library

  /* -- impl. sample --
    uint16_t TFT_eSPI::color565(uint8_t r, uint8_t g, uint8_t b) {
      return ((r & 0xF8) << 8) | ((g & 0xFC) << 3) | (b >> 3);
    }
  */

    // #define ILI9341_LIGHTGREY   0xC618      /* 192, 192, 192 */
    // #define ILI9341_DARKGREY 0x7BEF /* 128, 128, 128 */ !!!! NOT SAME VALUE !!!!

  #define ROTATE_SCREEN 0

    #define CLR_BLACK       ILI9341_BLACK
    #define CLR_WHITE       ILI9341_WHITE
    //#define CLR_LIGHTGREY   TFT_LIGHTGREY // ILI9341_BLACK, ILI9341_RED, ILI9341_CYAN
    // #define CLR_LIGHTGREY   0xC618 /* 192x3 */
    // #define CLR_GREY        0x8410 /* 128,128,128 */
    // #define CLR_DARKGREY    0x7BEF /* ? 128x3 ? */

    #define CLR_LIGHTGREY   0xCE59 /* 200x3 */
    #define CLR_GREY        0x8410 /* 128x3 */
    #define CLR_DARKGREY    0x3186 /* 50x3 */

    #define CLR_PINK        ILI9341_PINK

    #define BLACK 0x00
    #define WHITE 0x01

    // -- SPI SCreen - values to copy in TFT_eSPI/User_Select.h
    #define TFT_MISO 19
    #define TFT_MOSI 23
    #define TFT_CLK  18
    #define TFT_CS    5  // Chip select control pin
    #define TFT_DC   15  // Data Command control pin
    // connected to EN pin
    #define TFT_RST   -1

  // beware w/ that !!!
  static TFT_eSPI* _oled_display;
  static int _oled_ttyY = 0;
  static uint16_t drawColor = CLR_WHITE;
  static uint16_t txtBgColor = CLR_BLACK;

  static uint16_t screenOffsetX = 0; // MY_320
  static uint16_t screenOffsetY = 0;
  static uint16_t __screenWidth = 0; // MY_320
  static uint16_t __screenHeight = 0;

  // TODO
  static uint8_t __screenMode = -1;
  static uint8_t __screenBlittMode = -1;

  // ==== Color routine ====
  // 1 is always white
  // 0 is always black

  static uint16_t __getColor(uint16_t color) {
    uint16_t usedColor = color;
    if ( usedColor == BLACK ) { usedColor = CLR_BLACK; }
    else if ( usedColor == WHITE ) { usedColor = CLR_WHITE; }
    else if ( usedColor == 2 ) { usedColor = CLR_LIGHTGREY; }
    else if ( usedColor == 3 ) { usedColor = CLR_GREY; }
    else if ( usedColor == 4 ) { usedColor = CLR_DARKGREY; }
    else if ( usedColor == 5 ) { usedColor = CLR_PINK; }
    // else direct color value
    // ..... use palette impl. !!!
    return usedColor;
  }


  void GenericMCU_SCREEN::lock() {
    this->ready = false;
  }

  void GenericMCU_SCREEN::setup() {
    screenOffsetX = (320 - 128) / 2;
    screenOffsetY = (240 - 64) / 2;

    _oled_display = new TFT_eSPI();
    _oled_display->init();

    _oled_display->setRotation(1+ROTATE_SCREEN); // LANDSCAPE

    _oled_display->fillScreen(CLR_BLACK);

    // BG is transparent by default
    _oled_display->setTextColor(drawColor, txtBgColor);
    _oled_display->setTextSize(0); // if doesn't work --> try (1)

    setMode( SCREEN_MODE_320 );

    clear();
    blitt( SCREEN_BLITT_AUTO );

    // hosno effect for now
    // _oled_display->setWindow(0,0,160,128);
    _oled_display->setTextWrap(true, true);

    this->ready = true;
  }

  // ------------------------------
  static void __doBlitt() {
#ifdef SCREEEN_BUFFER
    // _b_doBlitt();
#else
    // ESP8266 specific impl. of yield() (Cf Wifi ops & deadlocks ....) (see AdaGFX samples)
    yield();
#endif
  }

  static void __blittIfNeeded() {
    if ( __screenBlittMode == SCREEN_BLITT_AUTO ) {
      __doBlitt();
    }
  }

  static void __drawString(int x, int y, char* str) {
      _oled_display->setCursor(x, y);
      _oled_display->print(str);

      #ifdef DBUG_ESP32
        Serial.print( str );
      #endif
  }
  // ------------------------------

  void GenericMCU_SCREEN::print(char* str) { 
    if ( !this->ready ) { Serial.print(str); return; }
    _oled_display->print(str);
    __blittIfNeeded();

    // ?? do I need to manage scrolling TTY ??
  }

  void GenericMCU_SCREEN::print(char ch) {
    if ( !this->ready ) { Serial.print(ch); return; }
    _oled_display->print(ch);
    __blittIfNeeded();

    // ?? do I need to manage scrolling TTY ??
  }

  void GenericMCU_SCREEN::print(int   val) {
    if ( !this->ready ) { Serial.print(val); return; }
    _oled_display->print(val);
    __blittIfNeeded();

    // ?? do I need to manage scrolling TTY ??
  }

