fgalliat/BasicAr/subComponents/ESP32_Pocketv3/mcu2/ESP32TwinMCU2.h
  void GenericMCU_SCREEN::print(float val) {
    if ( !this->ready ) { Serial.print(val); return; }
    _oled_display->print(val);
    __blittIfNeeded();

    // ?? do I need to manage scrolling TTY ??
  }

  // cursor in nb of chars (so max is 256x256)
  void GenericMCU_SCREEN::setCursor(int x, int y) {
    if ( !this->ready ) { return; }
    #define FONT_WIDTH (6+1)
    #define FONT_HEIGHT (8)
    _oled_display->setCursor((x*FONT_WIDTH)+screenOffsetX, (y*FONT_HEIGHT)+screenOffsetY );

    // !! TO remember if use ACTION_BUFFER !!
  }

  void GenericMCU_SCREEN::setColor(uint16_t color) {
    if ( !this->ready ) { return; }
    
    drawColor = color;
    // BG is transparent by default
    _oled_display->setTextColor(drawColor, txtBgColor);

    // !! TO remember if use ACTION_BUFFER !!
  }

  void GenericMCU_SCREEN::setMode(uint8_t mode) {
    if ( !this->ready ) { return; }
    
    if ( mode == SCREEN_MODE_128 ) {
      __screenWidth = 128;
      __screenHeight = 64;

      screenOffsetX = (320 - __screenWidth) / 2;
      screenOffsetY = (240 - __screenHeight) / 2;
      __screenMode = mode;
    } else if ( mode == SCREEN_MODE_160 ) {
      __screenWidth = 160;
      __screenHeight = 128;

      screenOffsetX = (320 - __screenWidth) / 2;
      screenOffsetY = (240 - __screenHeight) / 2;
      __screenMode = mode;
    } else if ( mode == SCREEN_MODE_320 ) {
      __screenWidth = 320;
      __screenHeight = 240;

      screenOffsetX = 0;
      screenOffsetY = 0;
      __screenMode = mode;
    } 
  }

  // mode : TEXT_OVERWRITE / TEXT_INCRUST
  void GenericMCU_SCREEN::setTextMode(uint8_t mode, uint16_t fg, uint16_t bg) {
    if ( !this->ready ) { return; }

    uint16_t _fg = CLR_WHITE;
    uint16_t _bg = CLR_BLACK;

    _fg = __getColor(fg);
    _bg = __getColor(bg);

    if ( mode == TEXT_OVERWRITE ) {
      _oled_display->setTextColor(_fg,_bg);
    } else if ( mode == TEXT_INCRUST ) {
      bg = TFT_TRANSPARENT;
      _oled_display->setTextColor(_fg,_bg);
    } 
  }

  void GenericMCU_SCREEN::blitt(uint8_t mode) {
    if ( !this->ready ) { return; }
    __screenBlittMode = mode;
    if ( mode >= SCREEN_BLITT_REQUEST ) {
      __doBlitt();
    }
  }

  uint8_t getBlittMode() {
    return __screenBlittMode;
  }

  // === Shapes routines ===


  int GenericMCU_SCREEN::getWidth() {
    return __screenWidth;
  }
  int GenericMCU_SCREEN::getHeight() {
    return __screenHeight;
  }

  void GenericMCU_SCREEN::clear() {
    if ( !this->ready ) { return; }

    _oled_display->setCursor( screenOffsetX, screenOffsetY );

    if ( __screenMode == SCREEN_MODE_128 ) {
      _oled_display->fillRect( screenOffsetX, screenOffsetY, 128, 64, CLR_BLACK );
    } else if ( __screenMode == SCREEN_MODE_160 ) {
      _oled_display->fillRect( screenOffsetX, screenOffsetY, 160, 128, CLR_BLACK );
    } else if ( __screenMode == SCREEN_MODE_320 ) {
      _oled_display->fillScreen( CLR_BLACK );
    } 

    __blittIfNeeded();
  }

  // mode = 1 : fill // mode = 0 : draw
  void GenericMCU_SCREEN::drawRect(int x, int y, int w, int h, uint8_t mode, uint16_t color) {
    if ( !this->ready ) { return; }

    uint16_t usedColor = __getColor(color);
    if ( mode == 0 ) {
      _oled_display->drawRect(screenOffsetX+x,screenOffsetY+y,w,h, usedColor);
    } else {
      _oled_display->fillRect(screenOffsetX+x,screenOffsetY+y,w,h, usedColor);
    }

    __blittIfNeeded();
  }

  void GenericMCU_SCREEN::drawCircle(int x, int y, int radius, uint8_t mode, uint16_t color) {
    if ( !this->ready ) { return; }

    uint16_t usedColor = __getColor(color);
    if ( mode == 0 ) {
      _oled_display->drawCircle(screenOffsetX+x,screenOffsetY+y,radius, usedColor);
    } else {
      _oled_display->fillCircle(screenOffsetX+x,screenOffsetY+y,radius, usedColor);
    }

    __blittIfNeeded();
  }

  void GenericMCU_SCREEN::drawLine(int x, int y, int x2, int y2, uint16_t color){
    if ( !this->ready ) { return; }

    uint16_t usedColor = __getColor(color);
    _oled_display->drawLine(screenOffsetX+x,screenOffsetY+y,screenOffsetX+x2,screenOffsetY+y2, usedColor);

    __blittIfNeeded();
  }

  void GenericMCU_SCREEN::drawPixel(int x, int y, uint16_t color){
    if ( !this->ready ) { return; }

    uint16_t usedColor = __getColor(color);
    _oled_display->drawPixel(x,y, usedColor);

    __blittIfNeeded();
  }

  // // see if keep that
  // void GenericMCU_SCREEN::drawTriangle(int x, int y, int x2, int y2, int x3, int y3, uint8_t mode=0, uint16_t color=1);
  // // see if keep that
  // void GenericMCU_SCREEN::drawPolyline(int* x, int* y, int nbPoints);

  // === Picture routines ===
  // void setPalette( uint16_t* pal, int length, int bpp=4 );

  // // for coords : keeps int(s) instead of uint16_t(s) because coords could be negative during transforms

  // // see if need to contains header : Cf fileWidth Vs drawWidth
  void GenericMCU_SCREEN::drawPicture565( uint16_t* raster, int x, int y, int w, int h ) {
    if ( !ready ) { return; }
    __blittIfNeeded();
  }

  //#define MEM_RAST_HEIGHT  16
  #define MEM_RAST_HEIGHT  128
  #define MEM_RAST_WIDTH   160
  #define MEM_RAST_LEN_u16 MEM_RAST_WIDTH * MEM_RAST_HEIGHT
  #define MEM_RAST_LEN_u8  MEM_RAST_LEN_u16 * 2

  #define PCT_HEADER_LEN 7

  #ifdef MAIN_INO_FILE
    uint16_t color_picturebuff[ MEM_RAST_LEN_u16 ];
  #else
    extern uint16_t color_picturebuff[];
  #endif

  // _w & _h to clip a zone...
  void GenericMCU_SCREEN::drawPicture565( char* filename, int x, int y, int _w, int _h ) {
    static int w=-1, h=-1; // img size
    static char header[PCT_HEADER_LEN];


    if ( !ready ) { return; }
    uint8_t prevBlittMode = __screenBlittMode;
    __screenBlittMode = SCREEN_BLITT_LOCKED;

    if ( filename != NULL ) {
      File f = SPIFFS.open(filename, "r");
      if ( !f ) { mcu->println("File not ready"); return; }
      f.seek(0);
      int readed = f.readBytes( (char*)header, PCT_HEADER_LEN);
      
      if ( header[0] == '6' && header[1] == '4' && header[2] == 'K' ) {
          w = ((int)header[3]*256) + ((int)header[4]);
          h = ((int)header[5]*256) + ((int)header[6]);
      } else {
          mcu->println( "Wrong PCT header" );
          mcu->print( (int)header[0] );
          mcu->print( ',' );
          mcu->print( (int)header[1] );
          mcu->print( ',' );
          mcu->print( (int)header[2] );
          mcu->println( "");
          // mcu->println( header );
      }
      // Serial.print("A.2 "); Serial.print(w); Serial.print('x');Serial.print(h);Serial.println("");
      if( w <= 0 || h <= 0 ) {
        f.close();
        return;
      }

