fgalliat/BasicAr/subComponents/ESP32_Pocketv3/mcu2/ESP32TwinMCU2.h
      int scanZoneSize = w*MEM_RAST_HEIGHT*2; // *2 -> u16
      int startX = screenOffsetX+x;
      int startY = screenOffsetY+y;

      int yy = 0;
      while( true ) { 
        // BEWARE : @ this time : h need to be 128
        readed = f.readBytes( (char*)color_picturebuff, scanZoneSize);
        //Serial.print("A.2 bis"); Serial.print(readed); Serial.print(" of ");Serial.print(w*h*2);Serial.println("");

        //_oled_display->pushRect(screenOffsetX+x, screenOffsetY+y+yy, w, MEM_RAST_HEIGHT, color_picturebuff);
        _oled_display->pushImage(startX, startY+yy, w, MEM_RAST_HEIGHT, color_picturebuff);
        yy += MEM_RAST_HEIGHT;
        if ( yy + (MEM_RAST_HEIGHT) > h ) { break; }
      }
      f.close();


    } else {
      // recall last MEM_RAST area
      int scanZoneSize = w*MEM_RAST_HEIGHT*2; // *2 -> u16
      int startX = screenOffsetX+x;
      int startY = screenOffsetY+y;
      _oled_display->pushImage(startX, startY, w, MEM_RAST_HEIGHT, color_picturebuff);
    }


    // Set TFT address window to clipped image bounds
    //_oled_display->startWrite(); // Requires start/end transaction now
    // _oled_display->setAddrWindow(screenOffsetX+x, screenOffsetY+y, w, h);

    
    //_oled_display->endWrite();

 
    __screenBlittMode = prevBlittMode;
    __blittIfNeeded();
  }

  #ifdef MAIN_INO_FILE
    uint8_t bpp_picturebuff[ 1024 ];
  #else
    extern uint8_t bpp_picturebuff[];
  #endif

  void GenericMCU_SCREEN::drawPictureBPP( char* filename, int x, int y ) {
    if ( !ready ) { return; }

    if ( filename != NULL ) {
      File f = SPIFFS.open(filename, "r");
      if ( !f ) { mcu->println("File not ready"); return; }

      int w = 128;
      int h = 64;

      if( w <= 0 || h <= 0 ) {
        f.close();
        return;
      }

      int readed = f.readBytes( (char*)bpp_picturebuff, 1024);
      this->drawPictureBPP(bpp_picturebuff, x, y);
      f.close();

    } else {
      // recall last MEM_RAST area
      this->drawPictureBPP(bpp_picturebuff, x, y);
    }

    __blittIfNeeded();
  }

  // == just a try @ this time ==

  // destMode is SCREEN_MODE_320
  void drawPixShaded(int x, int y, uint16_t color, int fromMode ) {
    int sx = 0; // screenOffsetX;
    int sy = 0; // screenOffsetY;

    // REFACTO that code
    // if ( fromMode == SCREEN_MODE_128 ) {
    //   int b__screenWidth = 128;
    //   int b__screenHeight = 64;

    //   sx = (320 - b__screenWidth) / 2;
    //   sy = (240 - b__screenHeight) / 2;
    // } else if ( fromMode == SCREEN_MODE_160 ) {
    //   int b__screenWidth = 160;
    //   int b__screenHeight = 128;

    //   sx = (320 - b__screenWidth) / 2;
    //   sy = (240 - b__screenHeight) / 2;
    // } else if ( fromMode == SCREEN_MODE_320 ) {
    //   int b__screenWidth = 320;
    //   int b__screenHeight = 240;

    //   sx = 0;
    //   sy = 0;
    // } 



    if ( __screenMode != SCREEN_MODE_320 ) {
      _oled_display->drawPixel(screenOffsetX+x, screenOffsetY+y, color);
      return;
    }

    if ( fromMode == SCREEN_MODE_128 ) {
      sx = (320-(128*2))/2;
      sy = (240-(64*3))/2;
      x*=2; int w=2;
      y*=3; int h=3;
      _oled_display->fillRect(sx+x, sy+y, w, h, color);
    } else if ( fromMode == SCREEN_MODE_160 ) {
      sx = (320-(160*2))/2;
      sy = (240-(128*2))/2; // check if not overflow (256 Vs 240)
      x*=2; int w=2;
      y*=2; int h=2;
      _oled_display->fillRect(sx+x, sy+y, w, h, color);
    } else if ( fromMode == SCREEN_MODE_320 ) {
      _oled_display->fillRect(sx+x, sy+y, 1, 1, color);
    } 

  }
  // ============================

  void GenericMCU_SCREEN::drawPictureBPP( uint8_t* raster, int x, int y ) {
    if ( !ready ) { return; }

    int sx = screenOffsetX + x;
    int sy = screenOffsetY + y;

    int width = 128;
    int height = 64;

    unsigned char c;

    // TODO : lock blitt

    //this->drawRect(sx, sy, 128, 64, 1, 0);
    this->clear();
    //drawPixShadedRect(x, y, 128, 64, CLR_BLACK, SCREEN_MODE_128 );

    for (int yy = 0; yy < height; yy++) {
      for (int xx = 0; xx < width; xx++) {
        c = (raster[(yy * (width / 8)) + (xx / 8)] >> (7 - ((xx) % 8))) % 2;
        if (c == 0x00) {
        }
        else {
            // _oled_display->drawPixel(sx + xx, sy + yy, CLR_WHITE);
            drawPixShaded(xx, yy, CLR_WHITE, SCREEN_MODE_128 );
        }
      }
    }    

    // NEED to blitt ??????
  }

  // void drawPictureIndexed( uint8_t* raster, int x, int y, int w=-1, int h=-1, bool includesPalette=false );

void GenericMCU_SCREEN::drawPicture565Sprite( uint16_t* raster, int dx, int dy, int dw, int dh, int sx, int sy, int sw, int sh ) {

  static int lastOffset=-1,lastW=-1,lastH=-1;

  // BEWARE : mem overflow !!!!!
  // 32x64 seems to be the max @ this time
  // static uint16_t subImage[ dw*dh ];
  static uint16_t subImage[ 64*64 ];

  int startOffset = ( sy * dw ) + sx;
  int offset = startOffset;

  if (! ( lastOffset == offset && lastW == dw && lastH == dh ) ) {
    for(int yy=0; yy < dh; yy++) {
      // // TODO : find faster way !
      // for(int xx=0; xx < dw; xx++) {
      //   subImage[(yy*dw)+xx] = color_picturebuff[offset+xx];
      // }

      memcpy( &subImage[(yy*dw)], &color_picturebuff[offset], dw*sizeof(uint16_t) );

      offset = ( (sy+yy) * sw ) + sx;
    }
  }

  dx += screenOffsetX;
  dy += screenOffsetY;

  _oled_display->pushImage(dx, dy, dw, dh, subImage);

}

void GenericMCU_SCREEN::drawPicture565Sprite( char* filename, int dx, int dy, int dw, int dh, int sx, int sy ) {
  static int pctW=-1, pctH=-1;
  static char header[PCT_HEADER_LEN];

  if ( sx < 0 ) { sx = 0; }
  if ( sy < 0 ) { sy = 0; }

  if ( filename != NULL ) {
      File f = SPIFFS.open(filename, "r");

      if ( !f ) { mcu->println("File not ready"); return; }
      int readed = f.readBytes( (char*)header, PCT_HEADER_LEN);
      
      if ( header[0] == '6' && header[1] == '4' && header[2] == 'K' ) {
          pctW = ((int)header[3]*256) + ((int)header[4]);
          pctH = ((int)header[5]*256) + ((int)header[6]);
      } else {
          mcu->println( "Wrong PCT header" );
          mcu->println( header );

          f.close();
          return;
      }

      // need to store the whole sprite in mem.
      // in order that # subSprites to be recalled

      int toRead = (pctW * pctH)*2; // x2 Cf U16

      readed = f.readBytes( (char*)color_picturebuff, toRead);
      f.close();

      if ( dw < 0 ) { dw = pctW; }
      if ( dh < 0 ) { dh = pctH; }
      this->drawPicture565Sprite(color_picturebuff, dx, dy, dw, dh, sx, sy, pctW, pctH);

  } else {
      if ( dw < 0 ) { dw = pctW; }
      if ( dh < 0 ) { dh = pctH; }
      this->drawPicture565Sprite(color_picturebuff, dx, dy, dw, dh, sx, sy, pctW, pctH);
  }
  
}


#endif